In [3]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [4]:
ser1=Series(np.arange(3),index=['A','B','C'])

In [5]:
ser1

A    0
B    1
C    2
dtype: int32

In [6]:
ser=ser1*2

In [7]:
ser

A    0
B    2
C    4
dtype: int32

In [8]:
ser1['B']

1

In [9]:
ser1[0:2]

A    0
B    1
dtype: int32

In [10]:
ser1[1:]

B    1
C    2
dtype: int32

In [11]:
ser>=4

A    False
B    False
C     True
dtype: bool

In [12]:
ser<4

A     True
B     True
C    False
dtype: bool

In [13]:
dataframe=DataFrame(np.arange(25).reshape(5,5),index=['A','B','C','D','E'],columns=['C1','C2','C3','C4','C5'])

In [14]:
dataframe

   C1  C2  C3  C4  C5
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [15]:
dataframe['C2']

A     1
B     6
C    11
D    16
E    21
Name: C2, dtype: int32

In [16]:
dataframe[['C1','C2']]

   C1  C2
A   0   1
B   5   6
C  10  11
D  15  16
E  20  21

In [17]:
dataframe>10

      C1     C2     C3     C4     C5
A  False  False  False  False  False
B  False  False  False  False  False
C  False   True   True   True   True
D   True   True   True   True   True
E   True   True   True   True   True

In [18]:
dataframe[dataframe['C1']>=7]

   C1  C2  C3  C4  C5
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [19]:
dataframe

   C1  C2  C3  C4  C5
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [20]:
dataframe>10

      C1     C2     C3     C4     C5
A  False  False  False  False  False
B  False  False  False  False  False
C  False   True   True   True   True
D   True   True   True   True   True
E   True   True   True   True   True

In [24]:
c=dataframe.ix[0]

In [ ]:
c

C1    0
C2    1
C3    2
C4    3
C5    4
Name: A, dtype: int32

In [27]:
dataframe-c

   C1  C2  C3  C4  C5
A   0   0   0   0   0
B   5   5   5   5   5
C  10  10  10  10  10
D  15  15  15  15  15
E  20  20  20  20  20

In [30]:
# Rank and Sort
ser1=Series(range(3),index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int32

In [31]:
ser1.sort_index

<bound method Series.sort_index of A    0
B    1
C    2
dtype: int32>

In [35]:
from numpy.random import randn

In [36]:
ser2=Series(randn(10))

In [37]:
ser2

0    0.557086
1    0.872692
2   -0.121825
3    2.736769
4    1.807105
5   -0.141137
6   -0.094737
7    1.313114
8    0.517669
9   -1.506320
dtype: float64

In [38]:
ser2.rank()

0     6.0
1     7.0
2     3.0
3    10.0
4     9.0
5     2.0
6     4.0
7     8.0
8     5.0
9     1.0
dtype: float64

In [40]:
ser2.sort_index

<bound method Series.sort_index of 0    0.557086
1    0.872692
2   -0.121825
3    2.736769
4    1.807105
5   -0.141137
6   -0.094737
7    1.313114
8    0.517669
9   -1.506320
dtype: float64>

In [41]:
ser2

0    0.557086
1    0.872692
2   -0.121825
3    2.736769
4    1.807105
5   -0.141137
6   -0.094737
7    1.313114
8    0.517669
9   -1.506320
dtype: float64

In [49]:
data=DataFrame(randn(25).reshape(5,5),index=['A','B','C','D','E'],columns=['col1','col2','col3','col4','col5'])
data

       col1      col2      col3      col4      col5
A -2.021876 -1.425540 -1.467501 -0.360044 -0.375147
B  1.220692  0.434783  1.261325 -1.964497  0.014857
C  0.155107 -2.551897  0.853766  1.096941  0.736816
D  1.544115 -1.373908 -1.535576 -0.115202  0.048501
E  0.110700 -0.213367 -1.105979  0.044319 -0.223659

In [50]:
data1=DataFrame(np.arange(25).reshape(5,5),index=['A','B','C','D','E'],columns=['col1','col2','col3','col4','col5'])

In [51]:
data1

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19
E    20    21    22    23    24

In [52]:
import webbrowser

In [58]:
website="https://www.google.com.pk/"
webbrowser.open(website)

True